Material/tutorials/vortex_merger_icoFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0.0001";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
65536
(
(0.000677037 -0.000677014 0)
(0.00203107 -0.000676968 0)
(0.00338496 -0.000676877 0)
(0.00473862 -0.00067674 0)
(0.00609196 -0.000676556 0)
(0.00744489 -0.000676326 0)
(0.00879731 -0.000676049 0)
(0.0101491 -0.000675725 0)
...
)
;

boundaryField
{
    allPatches
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
