Material/tutorials/vortex_merger_icoFoam/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
65536
(
(0 -0 -1.05566e-17)
(0 -0 1.42675e-07)
(0 -0 1.63057e-07)
(0 -0 2.03822e-08)
(0 -0 8.15287e-08)
(0 -0 -6.11465e-08)
(0 -0 2.03822e-08)
(0 -0 -8.15287e-08)
...
)
;

boundaryField
{
    allPatches
    {
        type            calculated;
        value           nonuniform List<vector> 
1024
(
(0 -0 9.3758e-07)
(0 -0 2.79236e-06)
(0 -0 4.66752e-06)
(0 -0 6.54268e-06)
(0 -0 8.41783e-06)
(0 -0 1.03338e-05)
(0 -0 1.22497e-05)
(0 -0 1.4186e-05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
